In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('D:/anita madam rj/New folder/data/stats.csv')
df

        Name  Salary Country
0        Dan   40000     USA
1  Elizabeth   32000  Brazil
2        Jon   45000   Italy
3      Maria   54000     USA
4       Mark   72000     USA
5       Bill   62000  Brazil
6       Jess   92000   Italy
7      Julia   55000     USA
8       Jeff   35000   Italy
9        Ben   48000  Brazil

In [3]:
#mean salary
mean1=df['Salary'].mean()
mean1

53500.0

In [4]:
#sum of Salaries
sum1=df['Salary'].sum()
sum1

535000

In [5]:
#Maximun Salary
max1=df['Salary'].max()
max1

92000

In [6]:
#Minimun Salary
min1=df['Salary'].min()
min1

32000

In [7]:
#Total count
count1=df['Salary'].count()
count1

10

In [8]:
#Median 
median=df['Salary'].median()
median

51000.0

In [10]:
#Mode
Mode1=df['Salary'].mode()
Mode1

0    32000
1    35000
2    40000
3    45000
4    48000
5    54000
6    55000
7    62000
8    72000
9    92000
dtype: int64

In [14]:
countrywise_sum=df.groupby(['Country'])['Salary'].sum()
countrywise_sum

Country
Brazil    142000
Italy     172000
USA       221000
Name: Salary, dtype: int64

In [13]:
countrywise_count=df.groupby(['Country']).count()
countrywise_count

         Name  Salary
Country
Brazil      3       3
Italy       3       3
USA         4       4

Measure of variability

In [15]:
#variable of salaries
var1=df['Salary'].var()
var1

332055555.5555556

In [16]:
# standard deviation
std1=df['Salary'].std()
std1

18222.391598128816

measure of symetry

In [18]:
skew1=df.skew(axis=0, skipna=True)
skew1

Salary    1.021551
dtype: float64

In [19]:
#the skewness is positive so x will have right side tail.

## Covarience and correlation

In [20]:
bw=pd.read_csv('D:/anita madam rj/New folder/data/BirthWeight.csv')
bw.head()

   Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0          1                     34.7                  1895
1          2                     36.0                  2030
2          3                     29.3                  1440
3          4                     40.1                  2835
4          5                     35.7                  3090

In [21]:
bw.set_index('Infant ID', inplace=True)
bw.head()

           Gestational Age (Weeks)  Birth Weight (Grams)
Infant ID
1                             34.7                  1895
2                             36.0                  2030
3                             29.3                  1440
4                             40.1                  2835
5                             35.7                  3090

In [22]:
bw.cov()

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 9.963824              1798.025
Birth Weight (Grams)                 1798.025000            485478.750

In [23]:
bw.corr(method="pearson")

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 1.000000              0.817519
Birth Weight (Grams)                    0.817519              1.000000

In [ ]:
# Cavariance indicates that there is correlation exists be indicates there is correlation 
# correlation coefficient of 0.818 indicates the relationship between two variable is strong .